<a href='https://www.darshan.ac.in/'> <img src='https://www.darshan.ac.in/Content/media/DU_Logo.svg' width="250" height="300"/></a>
<pre>
<center><b><h1>Machine Learning - 2301CS621</b></center>
<center><b><h1>Lab - 1</b></center>    
<pre>

# Name :- Kevin Kagathara
# Enrollment No. :- 22010101080

## Step 1. Import the necessary libraries

In [1]:
import pandas as pd

## Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [3]:
chipo = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv",sep="\t")
chipo

### Step 4. See the first 10 entries

In [5]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Step 5. What is the number of observations in the dataset?

In [6]:
chipo.shape

(4622, 5)

In [11]:
chipo.shape[0]

4622

### Step 6. What is the number of columns in the dataset?

In [7]:
chipo.shape[1]

5

### Step 7. Print the name of all the columns.

In [10]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

### Step 8. How is the dataset indexed?

In [13]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

### Step 9. Which was the most-ordered item?

In [22]:
chipo.item_name.value_counts().head(1).index[0]

'Chicken Bowl'

### Step 10. For the most-ordered item, how many items were ordered?

In [41]:
grpchipo = chipo.groupby("item_name")

for gname,gdata in grpchipo:
    print(gname)
    print(gdata['quantity'].sum())

6 Pack Soft Drink
55
Barbacoa Bowl
66
Barbacoa Burrito
91
Barbacoa Crispy Tacos
12
Barbacoa Salad Bowl
10
Barbacoa Soft Tacos
25
Bottled Water
211
Bowl
4
Burrito
6
Canned Soda
126
Canned Soft Drink
351
Carnitas Bowl
71
Carnitas Burrito
60
Carnitas Crispy Tacos
8
Carnitas Salad
1
Carnitas Salad Bowl
6
Carnitas Soft Tacos
40
Chicken Bowl
761
Chicken Burrito
591
Chicken Crispy Tacos
50
Chicken Salad
9
Chicken Salad Bowl
123
Chicken Soft Tacos
120
Chips
230
Chips and Fresh Tomato Salsa
130
Chips and Guacamole
506
Chips and Mild Fresh Tomato Salsa
1
Chips and Roasted Chili Corn Salsa
23
Chips and Roasted Chili-Corn Salsa
18
Chips and Tomatillo Green Chili Salsa
45
Chips and Tomatillo Red Chili Salsa
50
Chips and Tomatillo-Green Chili Salsa
33
Chips and Tomatillo-Red Chili Salsa
25
Crispy Tacos
2
Izze
20
Nantucket Nectar
29
Salad
2
Side of Chips
110
Steak Bowl
221
Steak Burrito
386
Steak Crispy Tacos
36
Steak Salad
4
Steak Salad Bowl
31
Steak Soft Tacos
56
Veggie Bowl
87
Veggie Burrito
97
Veggie Crispy Tacos
1
Veggie Salad
6
Veggie Salad Bowl
18
Veggie Soft Tacos
8

In [42]:
c = grpchipo.sum()
c.sort_values(['quantity'],ascending = False).head(1)

,order_id,quantity,choice_description,item_price
item_name,,,,
Chicken Bowl,713926,761,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98 $10.98 $11.25 $8.75 $8.49 $11.25 $8.75 ...

### Step 11. What was the most ordered item in the choice_description column?

In [46]:
chipo.choice_description.value_counts().head(1)

choice_description
[Diet Coke]    134
Name: count, dtype: int64

### Step 12. How many items were orderd in total?

In [48]:
chipo.quantity.sum()

4972

### Step 13. Turn the item price into a float

#### Step 13.a. Check the item price type

In [52]:
chipo.item_price.dtype

dtype('O')

#### Step 13.b. Create a lambda function and change the type of item price

In [53]:
a = lambda x:float(x[1:])

In [54]:
chipo['item_price'] = chipo['item_price'].apply(a)

#### Step 13.c. Check the item price type

In [55]:
chipo.item_price.dtype

dtype('float64')

### Step 14. How much was the revenue for the period in the dataset?

In [58]:
revenue = (chipo.quantity * chipo.item_price).sum()
revenue

39237.02

### Step 15. How many orders were made in the period?

In [62]:
orders = chipo.order_id.value_counts().count()
orders

1834

In [70]:
#chipo['order_id'].unique() - find the unique values
chipo['order_id'].nunique()

1834

### Step 16. What is the average revenue amount per order?

In [73]:
average_revenue = revenue/orders
average_revenue

21.39423118865867

### Step 17. How many different items are sold?

In [76]:
chipo['item_name'].nunique()

50

### Download titanic CSV from internet and read the CSV file

In [80]:
df = pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Step 1. Calculate the total number of missing data in each attribute

In [84]:
#df.isnull() 
# if null then return true

df.isnull().sum()
#return the sum of true

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Step 2. Replace missing values with mean and median

In [91]:
meanAge = df['Age'].mean()
meadianAge = df['Age']

AttributeError: 'Series' object has no attribute 'meadian'

### Step 3. Replace missing values by category-wise mean (e.g., by gender or other criteria)

In [92]:
gdf = df.groupby("Sex")
dict1 = {}
for gname,gdata in gdf:
    print(gname)
    print(gdata.Age.mean())
    dict1.update({gname:gdata.Age.mean()})
    
dict1

female
27.915708812260537
male
30.72664459161148

{'female': 27.915708812260537, 'male': 30.72664459161148}

In [94]:
titanic = df.copy()
titanic['Age'] = titanic['Age'].fillna(df['Sex'].map(dict1))
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.915709,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

### Step 4. Calculate the number of duplicate rows and remove duplicates

Good Job